Revit 2027 API
PartMakerMethodToDivideVolumes.CanBeDivisionProfile(ElementId) Method
 Checks whether a family defines a profile which can be used by this method.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeDivisionProfile(
	ElementId familyId
)
Public Function CanBeDivisionProfile (
	familyId As ElementId
) As Boolean
public:
bool CanBeDivisionProfile(
	ElementId^ familyId
)
member CanBeDivisionProfile :
        familyId : ElementId -> bool
Parameters
familyId ElementId
 Element id of the family.
Return Value
Boolean
 True if the family defines a profile which can be used by a part maker, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
CanBeDivisionProfile Overload
Autodesk.Revit.DB Namespace